---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctPressureDropData.Viscosity
source: html/e0a5f558-485f-9ae7-d1fa-d4abb1c41c48.htm
---
# Autodesk.Revit.DB.Mechanical.DuctPressureDropData.Viscosity Property

The viscosity of the duct. Units: (kg/(ft·s)).

## Syntax (C#)
```csharp
public double Viscosity { get; }
```